src/cf/Catalogs/ИдентификаторыОбъектовМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыОбъектовМетаданных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>196</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Видимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Доступность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязателен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Событие_ПриИзменении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Алгоритмы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/РегистрыПравил.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РегистрыПравил</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеТипа</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрыПравил</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кэш</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Системный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязиПараметровВыбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>128</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыОбъектовМетаданных/Forms/Метаконфигуратор/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыплнитьДействие(Команда)
	Если Команда.Имя="ОткрытьОбработку" Тогда
		ТекущиеДанные=Элементы.дсОбработки.ТекущиеДанные;
		Если ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли; 
		ПлагиныКлиент.Открыть(ТекущиеДанные.Ссылка);

	ИначеЕсли Команда.Имя="ОбновитьПечатныеФормы" Тогда
		ПечатныеФормыСервер.ОбновитьПечатныеФормы();
		Элементы.дсПечатныеФормы.Обновить();

	ИначеЕсли Команда.Имя="ВыполнитьАлгоритм" Тогда
		Если НЕ Элементы.дсАлгоритмы.ТекущаяСтрока=Неопределено Тогда
			ВыполнитьАлгоритм(Элементы.дсАлгоритмы.ТекущаяСтрока);
		КонецЕсли;

	ИначеЕсли Команда.Имя="ОбновитьИдентификаторыОбъектовМетаданных" Тогда
		МетаконфигураторСервер.ОбновитьИдентификаторыОбъектовМетаданных();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполнитьАлгоритм(АлгоритмСсылка)
	ПараметрыАлгоритма=Новый Структура;
	Для каждого СтрокаКоллекции Из АлгоритмСсылка.ПараметрыАлгоритма Цикл
		ПараметрыАлгоритма.Вставить(СтрокаКоллекции.Имя, СтрокаКоллекции.Значение);
	КонецЦикла;
	Выполнить(АлгоритмСсылка.Алгоритм);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(Значение, ЭлементыОтбора, стрПоле="Владелец", стрВидСравнения="Равно")
	ЭлементОтбора=Неопределено; ПолеОтбора=Новый ПолеКомпоновкиДанных(стрПоле);
	Для каждого СтрокаКоллекции Из ЭлементыОтбора Цикл
		Если СтрокаКоллекции.ЛевоеЗначение=ПолеОтбора Тогда
			ЭлементОтбора=СтрокаКоллекции; Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЭлементОтбора=Неопределено Тогда
		ЭлементОтбора=ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение=ПолеОтбора;
		ЭлементОтбора.ВидСравнения=ВидСравненияКомпоновкиДанных[стрВидСравнения];
		ЭлементОтбора.Использование=Истина;
		ЭлементОтбора.РежимОтображения=РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	ЭлементОтбора.ПравоеЗначение=Значение;
КонецПроцедуры

&НаСервере
Функция МассивСсылок(Ссылка)
	Массив=Новый Массив;

	//Выборка=Справочники.ИдентификаторыОбъектовМетаданных.Выбрать(Ссылка,,, "Код");
	Выборка=Справочники.ИдентификаторыОбъектовМетаданных.Выбрать(Ссылка);
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления Тогда Продолжить; КонецЕсли;
		Массив.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат Массив; 
КонецФункции

&НаСервере
Функция ПриктограммаЭлемента(Ссылка)
	КартинкиМетаданных=СтруктураКартинок();
 	стрСсылка=Ссылка.ИмяПредопределенныхДанных;
	стрРодитель=Ссылка.Родитель.ИмяПредопределенныхДанных;
	//Метаданные.НайтиПоПолномуИмени(стрЗаменить(стрИмя, "_", "."))
	//Метаданные.НайтиПоПолномуИмени("Документ.ЗаказПокупателя.ТабличныеЧасти.Товары")
	//Метаданные.Документы.ЗаказПокупателя.ТабличныеЧасти.Товары

	Если стрСсылка="Документы" Или стрРодитель="Документы" Тогда
		Возврат КартинкиМетаданных["Документы"];
	КонецЕсли;

	Если стрСсылка="Справочники" Или стрРодитель="Справочники" Тогда
		Возврат КартинкиМетаданных["Справочники"]; 
	КонецЕсли;

	Если Найти(стрСсылка, "_Подвиды") > 0 Тогда
		Возврат КартинкиМетаданных["Подвиды"]; 
	КонецЕсли;

	Если Найти(стрСсылка, "_ТабличныеЧасти") > 0 Или Найти(стрРодитель, "_ТабличныеЧасти") > 0 Тогда
		Возврат КартинкиМетаданных["ТабличныеЧасти"];
	КонецЕсли;

	Если Найти(стрСсылка, "_ПечатныеФормы") > 0 Тогда
		Возврат КартинкиМетаданных["ПечатныеФормы"];
	КонецЕсли;

	Если Найти(стрСсылка, "_Плагины") > 0 Тогда
		Возврат КартинкиМетаданных["Плагины"];
	КонецЕсли;

	Возврат КартинкиМетаданных["Реквизит"];
КонецФункции

&НаСервере
Функция СтруктураКартинок()
	КартинкиМетаданных=Новый Структура;
	КартинкиМетаданных.Вставить("Константы", БиблиотекаКартинок.Константа);
	КартинкиМетаданных.Вставить("Справочники", БиблиотекаКартинок.Справочник);
//	КартинкиМетаданных.Вставить("Справочник", БиблиотекаКартинок.Справочник);
	КартинкиМетаданных.Вставить("Документы", БиблиотекаКартинок.Документ);
//	КартинкиМетаданных.Вставить("Документ", БиблиотекаКартинок.Документ);
	КартинкиМетаданных.Вставить("ЖурналыДокументов", БиблиотекаКартинок.ЖурналДокументов);
	КартинкиМетаданных.Вставить("Перечисления", БиблиотекаКартинок.Перечисление);
	КартинкиМетаданных.Вставить("Отчеты", БиблиотекаКартинок.Отчет);
	КартинкиМетаданных.Вставить("Обработки", БиблиотекаКартинок.Обработка);
	КартинкиМетаданных.Вставить("ПланыВидовХарактеристик", БиблиотекаКартинок.ПланВидовХарактеристик);
	КартинкиМетаданных.Вставить("ПланыСчетов", БиблиотекаКартинок.ПланСчетов);
	КартинкиМетаданных.Вставить("ПланыВидовРасчета", БиблиотекаКартинок.ПланВидовРасчета);
	КартинкиМетаданных.Вставить("РегистрыСведений", БиблиотекаКартинок.РегистрСведений);
	КартинкиМетаданных.Вставить("РегистрыНакопления", БиблиотекаКартинок.РегистрНакопления);
	КартинкиМетаданных.Вставить("РегистрыБухгалтерии", БиблиотекаКартинок.РегистрБухгалтерии);
	КартинкиМетаданных.Вставить("РегистрыРасчета", БиблиотекаКартинок.РегистрРасчета);
	КартинкиМетаданных.Вставить("БизнесПроцессы", БиблиотекаКартинок.БизнесПроцесс);
	КартинкиМетаданных.Вставить("Задачи", БиблиотекаКартинок.Задача);
	КартинкиМетаданных.Вставить("Реквизит", БиблиотекаКартинок.Реквизит);
	КартинкиМетаданных.Вставить("ТабличныеЧасти", БиблиотекаКартинок.Таблица);
	КартинкиМетаданных.Вставить("Подвиды", БиблиотекаКартинок.ПорядокНаступленияСобытия123);
	КартинкиМетаданных.Вставить("Плагины", БиблиотекаКартинок.Обработка);
	КартинкиМетаданных.Вставить("ПечатныеФормы", БиблиотекаКартинок.Печать);

	Возврат КартинкиМетаданных;
КонецФункции

&НаСервере
Функция ЭлементУдален(Ссылка, ВладелецСсылки, ТолькоПроверка=Ложь)
	Если ТипЗнч(Ссылка)=Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ТипЗнч(Ссылка)=Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизиты") Тогда
		МенеджерЗаписи=РегистрыСведений.ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Реквизит=Ссылка;
		МенеджерЗаписи.Владелец=ВладелецСсылки;
		МенеджерЗаписи.Прочитать();
		Если МенеджерЗаписи.Выбран() Тогда
			Если НЕ ТолькоПроверка Тогда
				МенеджерЗаписи.Отключен=НЕ МенеджерЗаписи.Отключен;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			Возврат МенеджерЗаписи.Отключен; 
		КонецЕсли;

	ИначеЕсли ТипЗнч(Ссылка)=Тип("СправочникСсылка.Подвиды") Тогда
		СправочникОбъект=Ссылка.ПолучитьОбъект();
		Если НЕ ТолькоПроверка Тогда
			СправочникОбъект.ПометкаУдаления=НЕ СправочникОбъект.ПометкаУдаления;
			СправочникОбъект.Записать();
		КонецЕсли;
		Возврат СправочникОбъект.ПометкаУдаления; 
	КонецЕсли;
	
	
КонецФункции

&НаКлиенте
Процедура ОбработчикОповещения_ПоказатьЗначение(Параметр1, Параметр2) Экспорт
	ТекущиеДанные=Элементы.дзМетаконфигуратор.ТекущиеДанные;
	Если ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли;
	ТекущиеДанные.Ссылка=Параметр2.Ссылка;
КонецПроцедуры

&НаСервере
Функция ИмяЭлемента(Ссылка, Родитель=Ложь)
	Если НЕ Родитель Тогда
		Возврат Ссылка.ИмяПредопределенныхДанных;
	КонецЕсли;
	Возврат Ссылка.Родитель.ИмяПредопределенныхДанных;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий "Мета-конфигуратор"

&НаСервере
Процедура дзМетаконфигуратор_Инициализация()
	дзДанные=РеквизитФормыВЗначение("дзМетаконфигуратор");

	спРодители=Новый СписокЗначений;
	спРодители.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.Справочники, "Справочник",,БиблиотекаКартинок.Справочник);
	спРодители.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.Документы, "Документ",,БиблиотекаКартинок.Документ);
	спРодители.Добавить(Справочники.ИдентификаторыОбъектовМетаданных.Задачи, "Задача",,БиблиотекаКартинок.Задача);

	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", спРодители);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.Ссылка КАК Ссылка,
	|	ИсточникДанных.Родитель КАК Родитель,
	|	ИсточникДанных.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Родитель В (&Родитель)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИсточникДанных.Наименование
	|ИТОГИ ПО
	|	ИсточникДанных.Родитель ИЕРАРХИЯ
	|";
	Выборка1=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Пока Выборка1.Следующий() Цикл
		Пиктограмма=спРодители.НайтиПоЗначению(Выборка1.Родитель).Картинка;

		Ветка=дзДанные.Строки.Добавить();
		Ветка.Ссылка=Выборка1.Родитель;
		Ветка.Пиктограмма=Пиктограмма;
		Ветка.ИмяПредопределенныхДанных=Выборка1.Родитель.ИмяПредопределенныхДанных;
		Ветка.Загружено=Истина;

		Выборка2=Выборка1.Выбрать();
		Пока Выборка2.Следующий() Цикл
			НоваяСтрока=Ветка.Строки.Добавить();
			НоваяСтрока.Ссылка=Выборка2.Ссылка;
			НоваяСтрока.Пиктограмма=Пиктограмма;
			НоваяСтрока.ИмяПредопределенныхДанных=Выборка2.ИмяПредопределенныхДанных;
			НоваяСтрока.Строки.Добавить(); //***
		КонецЦикла; 
	КонецЦикла; 

	ЗначениеВРеквизитФормы(дзДанные, "дзМетаконфигуратор");
КонецПроцедуры

&НаКлиенте
Процедура дзМетаконфигуратор_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//дзМетаконфигуратор_ПоказатьПравуюПанель();
КонецПроцедуры

&НаКлиенте
Функция ОписаниеВетки(ИдентификаторСтроки)
	СтруктураВозврата=Новый Структура;
	СтруктураВозврата.Вставить("Имя", "");
	СтруктураВозврата.Вставить("Ссылка", Неопределено);
	СтруктураВозврата.Вставить("Заголовок", "");	

	ТекущиеДанные=дзМетаконфигуратор.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ТипЗнч(ТекущиеДанные.Ссылка)=Тип("СправочникСсылка.ИдентификаторыОбъектовМетаданных") Тогда
		Массив=СтрРазделить(ТекущиеДанные.ИмяПредопределенныхДанных, "_");

		Если Массив.Количество() < 2 Тогда
			Возврат СтруктураВозврата;
		КонецЕсли;

		Если Массив.Количество() < 3 Тогда
			СтруктураВозврата.Ссылка=ТекущиеДанные.Ссылка;
			СтруктураВозврата.Заголовок=Массив[1];
			СтруктураВозврата.Имя=Массив[0];
			Возврат СтруктураВозврата;
		КонецЕсли;

		Если Массив[2]="ТабличныеЧасти" Тогда
			Возврат СтруктураВозврата;
		КонецЕсли; 

		//текДанные=ТекущиеДанные.ПолучитьРодителя();
		//Если НЕ Массив[2]="Реквизиты" Тогда
		//	текДанные=текДанные.ПолучитьРодителя();
		//КонецЕсли; 

		//Если Массив[0]="Документ" Тогда
		//	стрЗаголовок="Реквизиты документа ("+текДанные.Ссылка+")";
		//ИначеЕсли Массив[0]="Справочник" Тогда
		//	стрЗаголовок="Реквизиты справочника ("+текДанные.Ссылка+")";
		//КонецЕсли;

		//Если НЕ Массив[2]="Реквизиты" Тогда
		//	стрЗаголовок=стрЗаголовок+" табличной части ("+ТекущиеДанные.Ссылка+")";
		//КонецЕсли; 

		стрЗаголовок="Реквизиты";
		Если НЕ Массив[2]="Реквизиты" Тогда			
			стрЗаголовок="Реквизиты табличной части ("+ТекущиеДанные.Ссылка+")";
		КонецЕсли;	
		
		СтруктураВозврата.Ссылка=ТекущиеДанные.Ссылка;
		СтруктураВозврата.Заголовок=стрЗаголовок;
		СтруктураВозврата.Имя="Реквизиты";
		Возврат СтруктураВозврата;

	ИначеЕсли ТипЗнч(ТекущиеДанные.Ссылка)=Тип("Строка") Тогда //Подвиды, Печатные формы
		СтруктураВозврата.Ссылка=ТекущиеДанные.ПолучитьРодителя().Ссылка;
		СтруктураВозврата.Заголовок=СокрЛП(ТекущиеДанные.Ссылка)+" ("+СокрЛП(СтруктураВозврата.Ссылка)+")";
		СтруктураВозврата.Имя=ТекущиеДанные.Ссылка;
	КонецЕсли;

	Возврат СтруктураВозврата;
КонецФункции

&НаКлиенте
Процедура дзМетаконфигуратор_ПоказатьПравуюПанель()
	ОтключитьОбработчикОжидания("дзМетаконфигуратор_ПоказатьПравуюПанель");

	Элементы.Группа_Подвиды.Видимость=Ложь;
	Элементы.Группа_Плагины.Видимость=Ложь;
	Элементы.Группа_Реквизиты.Видимость=Ложь;
	Элементы.Группа_ПечтаныеФормы.Видимость=Ложь;
	Элементы.Группа_НастройкаФорм.Видимость=Ложь;
	Элементы.Группа_Свойства.Видимость=Ложь;
	
	СтруктураВетки=ОписаниеВетки(Элементы.дзМетаконфигуратор.ТекущаяСтрока);
	Если СтруктураВетки.Имя="Реквизиты" Тогда
		Элементы.Группа_Реквизиты.Видимость=Истина;		
		Элементы.Группа_Реквизиты.Заголовок=СтруктураВетки.Заголовок;
		УстановитьОтбор(СтруктураВетки.Ссылка, дсРеквизиты.Отбор.Элементы);
		//*** УстановитьОтбор(Ложь, дсРеквизиты.Отбор.Элементы, "Свойство");
	
	ИначеЕсли СтруктураВетки.Имя="Подвиды" Тогда
		Элементы.Группа_Подвиды.Видимость=Истина;
		Элементы.Группа_Подвиды.Заголовок=СтруктураВетки.Заголовок;
		УстановитьОтбор(СтруктураВетки.Ссылка, КлассификаторПодвидов.Отбор.Элементы);
		
	ИначеЕсли СтруктураВетки.Имя="Плагины" Тогда
		Элементы.Группа_Плагины.Видимость=Истина;		
		Элементы.Группа_Плагины.Заголовок=СтруктураВетки.Заголовок;
		УстановитьОтбор(СтруктураВетки.Ссылка, дсПлагины.Отбор.Элементы);
		
	ИначеЕсли СтруктураВетки.Имя="Печатные формы" Тогда
		Элементы.Группа_ПечтаныеФормы.Видимость=Истина;
		Элементы.Группа_ПечтаныеФормы.Заголовок=СтруктураВетки.Заголовок;
		УстановитьОтбор(СтруктураВетки.Ссылка, дсПечатныеФормы.Отбор.Элементы);

	ИначеЕсли СтруктураВетки.Имя="Свойства" Тогда
		Элементы.Группа_Свойства.Видимость=Истина;
		УстановитьОтбор(СтруктураВетки.Ссылка, дсРеквизиты.Отбор.Элементы);

	ИначеЕсли СтруктураВетки.Имя="Документ" Или СтруктураВетки.Имя="Справочник" Тогда
		Элементы.Группа_НастройкаФорм.Видимость=Истина;
		УстановитьОтбор(СтруктураВетки.Ссылка, дсНастройкиДинСписков.Отбор.Элементы, "ИсточникДанных");
		УстановитьОтбор(СтруктураВетки.Ссылка, днНастройкиФормыОбъекта.Отбор.Элементы, "ИсточникДанных");
		//*** УстановитьОтбор(СтруктураВетки.Ссылка, дсРеквизиты.Отбор.Элементы);
		//*** УстановитьОтбор(Истина, дсРеквизиты.Отбор.Элементы, "Свойство");
	КонецЕсли;	
КонецПроцедуры
 
&НаКлиенте
Процедура дзМетаконфигуратор_ПриАктивизацииСтроки(Элемент)
	Если ТекущаяСтрокаМетаконфигуратора=Элемент.ТекущаяСтрока Тогда Возврат; КонецЕсли; 
	ТекущаяСтрокаМетаконфигуратора=Элемент.ТекущаяСтрока;	
	
	ПодключитьОбработчикОжидания("дзМетаконфигуратор_ПоказатьПравуюПанель", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура дзМетаконфигуратор_ПередНачаломИзменения(Элемент, Отказ)
	//Сообщить(123);
КонецПроцедуры

&НаКлиенте
Процедура дзМетаконфигуратор_ПередУдалением(Элемент, Отказ)
	Отказ=Истина;
	Элемент.ТекущиеДанные.Удален=ЭлементУдален(Элемент.ТекущиеДанные.Ссылка, Элемент.ТекущиеДанные.Владелец, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура дзМетаконфигуратор_ПередРазворачиванием(Элемент, Строка, Отказ)
	дзМетаконфигуратор_ЗаполнитьВетку(Строка);	
КонецПроцедуры

&НаКлиенте
Процедура дзМетаконфигуратор_ПриСменеТекущегоРодителя(Элемент)
	
КонецПроцедуры

&НаКлиенте
Функция дзМетаконфигуратор_ДобавитьСтроку(КоллекцияЭлементов, Ссылка1, Ссылка2, Пиктограмма=Неопределено, Загружено=Ложь)
	НоваяСтрока=КоллекцияЭлементов.Добавить();
	НоваяСтрока.Владелец=Ссылка1;
	НоваяСтрока.Ссылка=Ссылка2;	
	НоваяСтрока.Пиктограмма=?(Пиктограмма=Неопределено, ПриктограммаЭлемента(Ссылка2), Пиктограмма);
	НоваяСтрока.Загружено=Загружено;
	НоваяСтрока.Удален=ЭлементУдален(Ссылка2, Ссылка1, Истина);
	НоваяСтрока.ИмяПредопределенныхДанных=ИмяЭлемента(Ссылка2); //****
	Возврат НоваяСтрока; 
КонецФункции
 
&НаКлиенте
Процедура дзМетаконфигуратор_ЗаполнитьВетку(ИдентификаторСтроки)
	ТекущиеДанные=дзМетаконфигуратор.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если ТекущиеДанные.Загружено Тогда Возврат; КонецЕсли;

	ТекущиеДанные.Загружено=Истина;
	Ссылка=ТекущиеДанные.Ссылка;

	КоллекцияЭлементов=ТекущиеДанные.ПолучитьЭлементы();
	КоллекцияЭлементов.Очистить();

	стрРодитель=ИмяЭлемента(Ссылка, Истина);
	
	Если стрРодитель="Документы" Или стрРодитель="Справочники" Тогда
		//Подвиды
		НоваяСтрока=КоллекцияЭлементов.Добавить();
		НоваяСтрока.Ссылка="Подвиды";	
		НоваяСтрока.Пиктограмма=БиблиотекаКартинок.ПорядокНаступленияСобытия123;

		//Плагины
		НоваяСтрока=КоллекцияЭлементов.Добавить();
		НоваяСтрока.Ссылка="Плагины";	
		НоваяСтрока.Пиктограмма=БиблиотекаКартинок.Обработка;

		//Печатные формы
		НоваяСтрока=КоллекцияЭлементов.Добавить();
		НоваяСтрока.Ссылка="Печатные формы";	
		НоваяСтрока.Пиктограмма=БиблиотекаКартинок.Печать;

		//Свойства
		НоваяСтрока=КоллекцияЭлементов.Добавить();
		НоваяСтрока.Ссылка="Свойства";	
		НоваяСтрока.Пиктограмма=БиблиотекаКартинок.Свойства;
	КонецЕсли;

	МасссивСсылок1=МассивСсылок(Ссылка);
	Для каждого Ссылка1 Из МасссивСсылок1 Цикл
		НоваяСтрока=дзМетаконфигуратор_ДобавитьСтроку(КоллекцияЭлементов,,Ссылка1);
		
		КоллекцияЭлементов1=НоваяСтрока.ПолучитьЭлементы();
		Если НЕ МассивСсылок(Ссылка1).Количество()=0 Тогда
			КоллекцияЭлементов1.Добавить();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Копирование регистра правил

&НаКлиенте
Процедура СкопироватьПравило_Клиент(Параметр1, Параметр2=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Параметр1) Тогда Возврат; КонецЕсли; 
	//Если НЕ Параметр1=КодВозвратаДиалога.Да Тогда Возврат; КонецЕсли;
	СкопироватьПравило_Сервер(Элементы.ДинамическийСписок.ТекущиеДанные.Ссылка, Параметр1);
КонецПроцедуры

&НаСервере
Процедура СкопироватьПравило_Сервер(Ссылка, Идентификатор)
	Справочники.РегистрыПравил.СкопироватьПравило(Ссылка, Идентификатор);
	Элементы.ДинамическийСписок.Обновить();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	дзМетаконфигуратор_Инициализация();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия="ЗаписанПодвид" Тогда
	//	ОбработчикОповещения_Подвиды(Параметр, Ложь);
	//КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	//Если ТипЗнч(Источник)=Тип("УправляемаяФорма") Тогда
	//	ТекущиеДанные=Элементы.дзМетаконфигуратор.ТекущиеДанные;
	//	Если ТекущиеДанные=Неопределено Тогда Возврат; КонецЕсли;

	//	Если Источник.ИмяФормы="Справочник.Подвиды.Форма.ФормаЭлемента" Тогда
	//		Если ТипЗнч(ТекущиеДанные.Ссылка)=Тип("СправочникСсылка.Подвиды") Тогда
	//			КоллекцияЭлементов=ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();
	//		Иначе
	//			КоллекцияЭлементов=ТекущиеДанные.ПолучитьЭлементы();
	//		КонецЕсли;			
	//		дзМетаконфигуратор_ДобавитьСтроку(КоллекцияЭлементов, Неопределено, НовыйОбъект, БиблиотекаКартинок.Реквизит);

	//	ИначеЕсли Источник.ИмяФормы="РегистрСведений.ДополнительныеРеквизиты.Форма.ФормаЗаписи" Тогда
	//		Если ТипЗнч(ТекущиеДанные.Ссылка)=Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизиты") Тогда
	//			КоллекцияЭлементов=ТекущиеДанные.ПолучитьРодителя().ПолучитьЭлементы();				
	//		Иначе
	//			КоллекцияЭлементов=ТекущиеДанные.ПолучитьЭлементы();
	//		КонецЕсли;
	//		дзМетаконфигуратор_ДобавитьСтроку(КоллекцияЭлементов, Неопределено, Источник.Запись.Реквизит, БиблиотекаКартинок.Реквизит);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры
